:PROPERTIES:
:ID:       d7232721-a1e8-461a-a47d-7ce7b11134f0
:END:
#+title: ENG331 - Control Systems 1 - Lab 3
#+date: [2025-09-09 Tue 11:51]
#+AUTHOR: Baley Eccles - 652137
#+FILETAGS: :Assignment:UTAS:2025:
#+STARTUP: latexpreview
#+LATEX_HEADER: \usepackage[a4paper, margin=2cm]{geometry}
#+LATEX_HEADER_EXTRA: \usepackage{minted}
#+LATEX_HEADER_EXTRA: \usepackage{fontspec}
#+LATEX_HEADER_EXTRA: \setmonofont{Iosevka}
#+LATEX_HEADER_EXTRA: \setminted{fontsize=\small, frame=single, breaklines=true}
#+LATEX_HEADER_EXTRA: \usemintedstyle{emacs}
#+LATEX_HEADER_EXTRA: \usepackage{float}
#+LATEX_HEADER_EXTRA: \setlength{\parindent}{0pt}
#+LATEX_HEADER_EXTRA: \setlength{\parskip}{1em}

* TODO Part 3 – Analysis [16 Marks, ILO 4]
/a) Generate the pole-zero plot of the open-loop system consisting of the controller and the plant, but no feedback. Use your linearised model about your initial operating point (Part 2 step 4) for $G_2(s)$, and use your tuned controller parameters to find $G_1(s)$. Make sure to keep track of which poles/zeros come from the plant, and which come from the controller using different symbols or colours. [4 marks]/

Using: $G_1(s) = \frac{K_ds^2 + K_ps + K_i}{s}$ and $G_2(s) &= \frac{K_{pump}}{A_1s + \frac{A_{o1}C_d \sqrt{2g}}{2\sqrt{h_{1,0}}}}$

#+BEGIN_SRC octave :exports code :results output :session Part_3
clc
clear
close all

if exist('OCTAVE_VERSION', 'builtin')
  set(0, "DefaultLineLineWidth", 2);
  set(0, "DefaultAxesFontSize", 25);
  warning('off');
  pkg load control
  pkg load symbolic
end

K_p = 1;
K_i = 0.04;
K_d = 0.25;
T_f = 10e4;

%s = tf('s')
syms s
G_1 = (K_d*s*s + K_p*s + K_i)/s;


g = 9.81;
C_d = 0.708;
D_o1 = 4e-3;
A_o1 = pi*(D_o1/2)^2;
D_1 = 4.5e-2;
A_1 = pi*(D_1/2)^2;
K_pump = 0.0000035;
h_1_0 = 15e-2;
V_P_0 = 5;

G_2 = (K_pump)/(A_1*s + (A_o1*C_d*sqrt(2*g))/(2*sqrt(h_1_0)));

G = G_1*G_2;
[num, den] = numden(G);
poles = double(vpa(solve(den, s)))
zeros = double(vpa(solve(num, s)))

figure;
hold on;
plot(real(poles(1)), imag(poles(1)), 'bx', 'MarkerSize', 20);
plot(real(poles(2)), imag(poles(2)), 'rx', 'MarkerSize', 20);

plot(real(zeros(1)), imag(zeros(1)), 'bo', 'MarkerSize', 20);
plot(real(zeros(2)), imag(zeros(2)), 'bo', 'MarkerSize', 20);
axis([-5, 0.1, -20, 20]);
grid on;
legend("PID", "System");
set (gca, "xaxislocation", "origin");
set (gca, "yaxislocation", "origin");
xlabel('Re(s)');
ylabel('Im(s)');
print -dpng 'ENG331_P3_Pole_Zero_Open_Loop.png'
#+END_SRC

#+RESULTS:
: poles =
: 
:           0
:   -0.031989
: zeros =
: 
:   -3.959592
:   -0.040408

/b) Use MATLAB to find the closed-loop transfer function for the system using the open loop transfer function G_1(s)G_2(s) derived in a). [2 marks]/
#+BEGIN_SRC octave :exports code :results output :session Part_3
CL = vpa(simplify(G_1*G_2/(1 + G_1*G_2)))
latex(CL)
#+END_SRC

#+RESULTS:
#+begin_example
CL = (sym)

                                                             ⎛      2                ⎞                   ↪
                           10672736174.579418030794760427657⋅⎝25.0⋅s  + 100.0⋅s + 4.0⎠                   ↪
  ────────────────────────────────────────────────────────────────────────────────────────────────────── ↪
                                     2                                                                   ↪
  485245749789364.48545076986901069⋅s  + 16581306486197.260445527805834692⋅s + 42690944698.3176721231790 ↪
  
  ↪        
  ↪        
  ↪ ───────
  ↪        
  ↪ 4171063
\frac{10672736174.579418030794760427657 \left(25.0 s^{2} + 100.0 s + 4.0\right)}{485245749789364.48545076986901069 s^{2} + 16581306486197.260445527805834692 s + 42690944698.31767212317904171063}
#+end_example
\[\frac{10672736174 \left(25 s^{2} + 100 s + 4\right)}{485245749789364 s^{2} + 16581306486197 s + 42690944698}\]

/c) Generate the pole-zero plot of the closed-loop system $T(s)$. [2 marks]/

#+BEGIN_SRC octave :exports code :results output :session Part_3
[num_CL, den_CL] = numden(CL);
poles_CL = double(vpa(solve(den_CL, s)))
zeros_CL = double(vpa(solve(num_CL, s)))

figure;
hold on;
plot(real(poles_CL(2)), imag(poles_CL(2)), 'bx', 'MarkerSize', 20);
plot(real(poles_CL(1)), imag(poles_CL(1)), 'rx', 'MarkerSize', 20);

plot(real(zeros_CL(1)), imag(zeros_CL(1)), 'bo', 'MarkerSize', 20);
plot(real(zeros_CL(2)), imag(zeros_CL(2)), 'bo', 'MarkerSize', 20);
axis([-20.5, 0.1, -20, 20]);
grid on;
legend("PID", "System");
set (gca, "xaxislocation", "origin");
set (gca, "yaxislocation", "origin");
xlabel('Re(s)');
ylabel('Im(s)');
print -dpng 'ENG331_P3_Pole_Zero_Closed_Loop.png'
#+END_SRC

#+RESULTS:
: poles_CL =
: 
:   -3.1366e-02
:   -2.8049e-03
: zeros_CL =
: 
:   -3.959592
:   -0.040408

/d) Does the second order approximation apply to the closed loop system T_s(s) found in b) (will an appropriate second order transfer function give an approximately equal step response). [2 marks]/
The second-order approximation does not apply well to the closed-loop system. Although there is a dominant complex conjugate pair located at approximately -0.0492 with imaginary part ±0.1051 that produces the oscillatory transient, there is also a slower real pole at approximately -0.0334, which is closer to the imaginary axis and therefore dominates the long-term behaviour. Using the complex pair alone yields a natural frequency of approximately 0.1161 radians per second and a damping ratio of approximately 0.424, which predicts a roughly 23% overshoot and a settling time of approximately 81 seconds. However, the slow real pole has a time constant of roughly 29.9 seconds, so four time constants is about 120 seconds. Therefore, a second-order model based only on the complex pair underestimates the long tail in the step response and does not capture the true settling behaviour. In short, a second-order approximation can reproduce the initial oscillatory shape but fails to represent the slow decay imposed by the extra real pole, so it is only an approximation rather than an accurate model of the full closed-loop step response.

/e) Use the results from a) - d) to discuss why the parameters values you selected gave a step response that met the given performance metrics. Ie. why did the PID controller give a closed loop time domain response that met the desired performance metrics with those specific PID parameters. [6 marks]/
The chosen PID parameters produce the observed time domain behaviour because each term shapes the loop in a complementary way. The proportional gain increases loop gain and bandwidth and moves poles to the left so the response is faster. The integral gain, kept small, guarantees zero steady state error while avoiding excessive low-frequency phase lag. The derivative gain adds phase lead and introduces two controller zeros that increase damping around the crossover frequency. Concretely, the controller creates zeros near -3.96 and -0.0404 together with an integrator pole at the origin; the far left zero helps with high frequency shaping while the near origin zero modifies the low frequency interaction between the integrator and the slow plant dynamics. The resulting closed-loop poles at approximately -0.0334 and  -0.0492 with imaginary part ±0.1051 give a moderately damped oscillatory transient with a damping ratio of about 0.424 and roughly 23% overshoot from the complex pair, while the slow real pole determines the long settling tail. Thus, the above choices of PID parameters achieve zero steady state error and a transient that meets the desired damping and overshoot objectives, with the longer settling time being the trade-off caused by using a modest integral gain to limit low-frequency phase degradation.
